app/Models/ProductModel.php

    public function getProducts() {
        return $this->findAll();
---
SELECT *
FROM `products`

    public function getProductById($id) {
        return $this->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '2'